

Network Working Group                                         N. Bahadur
Internet-Draft                                               R. Aggarwal
Updates: 4379 (if approved)                       Juniper Networks, Inc.
Intended status: Standards Track                              S. Boutros
Expires: December 17, 2011                           Cisco Systems, Inc.
                                                                 E. Gray
                                                                Ericsson
                                                           June 15, 2011


       MPLS On-demand Connectivity Verification and Route Tracing
                   draft-ietf-mpls-tp-on-demand-cv-04

Abstract

   LSP-Ping is an existing and widely deployed OAM mechanism for MPLS
   LSPs.  This document describes extensions to LSP-Ping so that LSP-
   Ping can be used for On-demand Connectivity Verification of MPLS-TP
   LSPs.  This document also clarifies procedures to be used for
   processing the related OAM packets.  Further, it describes procedures
   for using LSP-Ping to perform Connectivity Verification and Route
   Tracing functions in MPLS-TP networks.  Finally this document updates
   RFC 4379 by adding a new address type and requesting a registry.

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on December 17, 2011.

Copyright Notice

   Copyright (c) 2011 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents



Bahadur, et al.         Expires December 17, 2011               [Page 1]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
     1.1.  Conventions used in this document  . . . . . . . . . . . .  4
     1.2.  On-demand CV for MPLS-TP LSPs using IP encapsulation . . .  4
     1.3.  On-demand CV for MPLS-TP LSPs using non-IP
           encapsulation  . . . . . . . . . . . . . . . . . . . . . .  5
   2.  LSP-Ping Extensions  . . . . . . . . . . . . . . . . . . . . .  5
     2.1.  New address type for Downstream Mapping TLV  . . . . . . .  5
       2.1.1.  DSMAP/DDMAP Non-IP Address Information . . . . . . . .  6
     2.2.  Source/Destination Identifier TLV  . . . . . . . . . . . .  7
       2.2.1.  Source/Destination Identifier TLV Format . . . . . . .  7
       2.2.2.  Source Identifier TLV  . . . . . . . . . . . . . . . .  7
       2.2.3.  Destination Identifier TLV . . . . . . . . . . . . . .  7
     2.3.  Identifying Statically provisioned LSPs and PWs  . . . . .  8
       2.3.1.  Static LSP Sub-TLV . . . . . . . . . . . . . . . . . .  8
       2.3.2.  Static Pseudowire Sub-TLV  . . . . . . . . . . . . . .  9
   3.  Performing On-demand CV over MPLS-TP LSPs  . . . . . . . . . .  9
     3.1.  LSP-Ping with IP encapsulation . . . . . . . . . . . . . . 10
     3.2.  On-demand CV with IP encapsulation, over ACH . . . . . . . 10
     3.3.  Non-IP based On-demand CV, using ACH . . . . . . . . . . . 11
     3.4.  Reverse Path Connectivity Verification . . . . . . . . . . 12
       3.4.1.  Requesting Reverse Path Connectivity Verification  . . 12
       3.4.2.  Responder Procedures . . . . . . . . . . . . . . . . . 12
       3.4.3.  Requester Procedures . . . . . . . . . . . . . . . . . 13
     3.5.  P2MP Considerations  . . . . . . . . . . . . . . . . . . . 13
     3.6.  Operation of On-demand CV with Static MPLS-TP  . . . . . . 13
     3.7.  GAL Label Processing . . . . . . . . . . . . . . . . . . . 13
   4.  Performing on-demand Route Tracing over MPLS-TP LSPs . . . . . 14
     4.1.  On-demand LSP Route Tracing with IP encapsulation  . . . . 14
     4.2.  Non-IP based On-demand LSP Route Tracing, using ACH  . . . 14
       4.2.1.  Requester procedure for sending echo request
               packets  . . . . . . . . . . . . . . . . . . . . . . . 14
       4.2.2.  Requester procedure for receiving echo response
               packets  . . . . . . . . . . . . . . . . . . . . . . . 15
       4.2.3.  Responder procedure  . . . . . . . . . . . . . . . . . 15
     4.3.  P2MP Considerations  . . . . . . . . . . . . . . . . . . . 15
     4.4.  ECMP Considerations  . . . . . . . . . . . . . . . . . . . 15
   5.  Applicability  . . . . . . . . . . . . . . . . . . . . . . . . 15



Bahadur, et al.         Expires December 17, 2011               [Page 2]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


   6.  Security Considerations  . . . . . . . . . . . . . . . . . . . 16
   7.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 16
     7.1.  New Source and Destination Identifier TLVs . . . . . . . . 16
     7.2.  New Target FEC Stack Sub-TLVs  . . . . . . . . . . . . . . 16
     7.3.  New Reverse-path Target FEC Stack TLV  . . . . . . . . . . 16
     7.4.  New Pseudowire Associated Channel Type . . . . . . . . . . 17
     7.5.  New RFC 4379 Registry  . . . . . . . . . . . . . . . . . . 17
   8.  Contributing Authors . . . . . . . . . . . . . . . . . . . . . 18
   9.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 18
     9.1.  Normative References . . . . . . . . . . . . . . . . . . . 18
     9.2.  Informative References . . . . . . . . . . . . . . . . . . 19
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 19







































Bahadur, et al.         Expires December 17, 2011               [Page 3]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


1.  Introduction

   LSP-Ping [RFC4379] is an OAM mechanism for MPLS LSPs.  This document
   describes extensions to LSP-Ping so that LSP-Ping can be used for on-
   demand monitoring of MPLS-TP LSPs.  It also clarifies the procedures
   to be used for processing the OAM packets.  This document describes
   how LSP-Ping can be used for on-demand Connectivity Verification
   (Section 3) and Route Tracing (Section 4) functions required in
   [RFC5860] and specified in [I-D.ietf-mpls-tp-oam-framework].

1.1.  Conventions used in this document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

   There is considerable opportunity for confusion in use of the terms
   "on-demand connectivity verification" (CV), "on-demand route tracing"
   and "LSP-Ping."  In this document, we try to use the terms
   consistently as follows:

   o  LSP-Ping: refers to the mechanism - particularly as defined and
      used in referenced material;
   o  On-demand CV: refers to on-demand connectivity verification and -
      where both apply equally - on-demand route tracing, as implemented
      using the LSP-Ping mechanism extended for support of MPLS-TP;
   o  On-demand route tracing: used in those cases where the LSP-Ping
      mechanism (as extended) is used exclusively for route tracing.

   From the perspective of on-demand CV and traceroute, we use the
   concepts of "Requester" and "Responder" as follows:

   o  Requester: Originator of an OAM Request message,
   o  Responder: Entity responding to an OAM Request message.

   Since - in this document - all messages are assumed to be carried in
   an LSP, all Request messages would be injected at the ingress to an
   LSP.  A Responder may or may not be at the egress of this same LSP,
   given that it may receive Request messages as a result of TTL expiry.
   If a Reply is to be delivered via a reverse path LSP, the message
   would again be inserted at the ingress of that LSP.

1.2.  On-demand CV for MPLS-TP LSPs using IP encapsulation

   LSP-Ping requires IP addressing on responding LSRs for performing OAM
   on MPLS signaled LSPs and pseudowires.  In particular, in these cases
   LSP-Ping packets generated by a Requester are encapsulated in an IP/
   UDP header with the destination address from the 127/8 range and then



Bahadur, et al.         Expires December 17, 2011               [Page 4]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


   encapsulated in the MPLS label stack ([RFC4379] , [RFC5884]).  A
   Responder uses the presence of the 127/8 destination address to
   identify OAM packets and relies further on the UDP port number to
   determine whether the packet is a LSP-Ping packet.  It is to be noted
   that this determination does not require IP forwarding capabilities.
   It requires the presence of an IP host stack which enables responding
   LSRs to process packets with a destination address from the 127/8
   range.  [RFC1122] allocates the 127/8 range as "Internal host
   loopback address" and [RFC1812] states that "a router SHOULD NOT
   forward, except over a loopback interface, any packet that has a
   destination address on network 127".

1.3.  On-demand CV for MPLS-TP LSPs using non-IP encapsulation

   In certain MPLS-TP deployment scenarios IP addressing might not be
   available or it may be preferred to use some form of non-IP
   encapsulation for On-demand CV, route tracing and BFD packets.  In
   such scenarios, On-demand CV and/or route tracing SHOULD be run
   without IP addressing, using the ACH channel type specified in
   Section 3.

   Section 3.3 and Section 4.2 describe the theory of operation for
   performing On-demand CV over MPLS-TP LSPs with any non-IP
   encapsulation.


2.  LSP-Ping Extensions

2.1.  New address type for Downstream Mapping TLV

   [RFC4379] defines the Downstream Mapping (DSMAP) TLV.
   [I-D.ietf-mpls-lsp-ping-enhanced-dsmap] further defines the
   Downstream Detailed Mapping (DDMAP) TLV.  This document defines the
   following new address type which MAY be used in any DSMAP or DDMAP
   TLV included in an On-demand CV message:

         Type #        Address Type           K Octets
         ------        --------------         --------
             5         Non IP                       12


             Figure 1: Downstream Mapping TLV new address type

   The new address type indicates that no address is present in the
   DSMAP or DDMAP TLV.  However, IF_Num information (see definition of
   "IF_NUM" in [I-D.ietf-mpls-tp-identifiers]) for both Requester and
   Responder interfaces, as well as multipath information is included in
   the format and MAY be present.



Bahadur, et al.         Expires December 17, 2011               [Page 5]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


   IF_Num values of zero indicate that no IF_Num applies in the field in
   which this value appears.

   Multipath type SHOULD be set to 0 (no multipath) when using this
   address type.

   When this address type is used, on receipt of a LSP-Ping echo
   request, interface verification MUST be bypassed.  Thus the receiving
   node SHOULD only perform mpls label control-plane/data-plane
   consistency checks.  Note that these consistency checks include
   checking of included identifier information.

   The new address type is also applicable to the Detailed Downstream
   Mapping (DDMAP) TLV defined in
   [I-D.ietf-mpls-lsp-ping-enhanced-dsmap].

2.1.1.  DSMAP/DDMAP Non-IP Address Information

   If the DSMAP (or DDMAP) TLV is included when sending On-demand CV
   packets using ACH, without IP encapsulation, the following
   information MUST be included in any DSMAP or DDMAP TLV that is
   included in the packet.  This information forms the address portion
   of the DSMAP TLV (as defined in [RFC4379]) or DDMAP TLV (as defined
   in [I-D.ietf-mpls-lsp-ping-enhanced-dsmap] using one of the address
   information fields defined in [RFC4379] and extended to include
   non-IP identifier types in this document).

        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |               MTU             | Address Type  |    DS Flags   |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |             Requester IF_Num (4 octets)                       |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |             Responder IF_Num (4 octets)                       |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       | Multipath Type| Depth Limit   |        Multipath Length       |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                 Figure 2: New DSMAP/DDMAP Address Format

   Address Type will be 5 (as shown in Section 2.1 above.

   Multipath type SHOULD be set to 0 (no multipath) when using this
   address type.






Bahadur, et al.         Expires December 17, 2011               [Page 6]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


2.2.  Source/Destination Identifier TLV

2.2.1.  Source/Destination Identifier TLV Format

   The format for the identifier TLV is the same for both Source and
   Destination Identifier TLVs (only the type is different).  The format
   is as specified in the figure below.

        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |             Type              | Length = 8                    |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |             Global_ID   (4 Octets)                            |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |         Node_ID   (4 Octets)                                  |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


            Figure 3: New Source/Destination Identifier Format

   Type will be one of either TBD-SRC or TBD-DST, depending on whether
   the TLV in question is a Source or Destination Identifier TLV.

   Global_ID is as defined in [I-D.ietf-mpls-tp-identifiers].

   Node_ID is as defined in [I-D.ietf-mpls-tp-identifiers].

2.2.2.  Source Identifier TLV

   When sending On-demand CV packets using ACH, without IP
   encapsulation, there MAY be a need to identify the source of the
   packet.  This source identifier will be specified via the Source
   Identifier TLV, using the Identifier TLV defined in Section 2.2.1,
   containing the information specified above.

   An On-demand CV packet MUST NOT include more than 1 Source Identifier
   TLV.  The Source Identifier TLV MUST specify the identifier of the
   originator of the packet.  If more than 1 such TLV is present in an
   On-demand CV request packet, then an error of 1 (Malformed echo
   request received, Section 3.3 [RFC4379]) MUST be returned, if it is
   possible to unambiguously identify the source of the packet.

2.2.3.  Destination Identifier TLV

   When sending On-demand CV packets using ACH, without IP
   encapsulation, there MAY be a need to identify the destination of the
   packet.  This destination identifier will be specified via the



Bahadur, et al.         Expires December 17, 2011               [Page 7]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


   Destination Identifier TLV, using the Identifier TLV defined in
   Section 2.2.1, containing the information specified above.

   An On-demand CV packet MUST NOT include more than 1 Destination
   Identifier TLV.  The Destination Identifier TLV MUST specify the
   destination node for the packet.  If more than 1 such TLV is present
   in an On-demand CV Request packet, then an error of 1 (Malformed echo
   request received, Section 3.3 [RFC4379]) MUST be returned, if it is
   possible to unambiguously identify the source of the packet.

2.3.  Identifying Statically provisioned LSPs and PWs

   [RFC4379] specifies how an MPLS LSP under test may be identified in
   an echo request.  A Target FEC Stack TLV is used to identify the LSP.
   In order to identify a statically provisioned LSP and PW, new target
   FEC stack sub-TLVs are being defined.  The new sub-TLVs are assigned
   sub-type identifiers as follows, and are described in the following
   sections.

         Type #   Sub-Type #       Length        Value Field
         ------   ----------       ------        -----------
           1         22              24          Static LSP
           1         23              24          Static Pseudowire

                    Figure 4: New target FEC sub-types

2.3.1.  Static LSP Sub-TLV

   The format of the Static LSP sub-TLV value field is specified in the
   following figure.  The value fields are taken from the definitions in
   [I-D.ietf-mpls-tp-identifiers].

        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                       Source Global ID                        |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        Source Node ID                         |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |     Source Tunnel Number      |        LSP Number             |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                    Destination Global ID                      |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                     Destination Node ID                       |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |   Destination Tunnel Number   |        Must be Zero           |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+




Bahadur, et al.         Expires December 17, 2011               [Page 8]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


                     Figure 5: Static LSP FEC Sub-TLV

   The Source global ID and Destination Global ID MAY be set to 0.  When
   set to zero, the field is not applicable.

2.3.2.  Static Pseudowire Sub-TLV

   The format of the Static PW sub-TLV value field is specified in the
   following figure.

        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                          AGI (MSW)                            |
       +- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -+
       |                          AGI (LSW)                            |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                       Source Global ID                        |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        Source Node ID                         |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                         Source AC-ID                          |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                    Destination Global ID                      |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                     Destination Node ID                       |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                     Destination AC-ID                         |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                      Figure 6: Static PW FEC Sub-TLV

   Attachment Group Identifier (AGI) is included in the first two words,
   in most-significant, least-significant word order, as shown.

   The Source global ID and Destination Global ID MAY be set to 0.  When
   set to zero, the field is not applicable.

   The AGI, Global ID and Node ID fields are defined in
   [I-D.ietf-mpls-tp-identifiers].  The AC-ID fields are defined in
   [RFC5003].


3.  Performing On-demand CV over MPLS-TP LSPs

   This section specifies how On-demand CV can be used in the context of
   MPLS-TP LSPs.  The On-demand CV function meets the On-demand



Bahadur, et al.         Expires December 17, 2011               [Page 9]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


   Connectivity Verification requirements specified in [RFC5860],
   section 2.2.3.  This function SHOULD NOT be performed except in the
   on-demand mode.  This function SHOULD be performed between End Points
   (MEPs) and Intermediate Points (MIPs) of PWs and LSPs, and between
   End Points of PWs, LSPs and Sections.  In order for the On-demand CV
   packet to be processed at the desired MIP, the TTL of the MPLS label
   should be set such that it expires at the MIP to be probed.

   [RFC5586] defines an ACH mechanism for MPLS LSPs.  The mechanism is a
   generalization of Associated Channel mechanism that [RFC4385] defined
   for use with Pseudowires.  As a result, a single Associated Channel
   Type may be used for either an LSP or Pseudowire.

   A new Pseudowire Associated Channel Type (type TBD-2) is defined for
   use in performing On-demand Connectivity Verification.  Its use is
   described in the following sections.

   Except as specifically stated in the sections below, message and TLV
   construction procedures for On-demand CV messages are as defined in
   [RFC4379].

3.1.  LSP-Ping with IP encapsulation

   LSP-Ping packets, as specified in [RFC4379], are sent over the MPLS
   LSP for which OAM is being performed and contain an IP/UDP packet
   within them.  The IP header is not used for forwarding (since LSP
   forwarding is done using MPLS label switching).  The IP header is
   used mainly for addressing and can be used in the context of MPLS-TP
   LSPs.  This form of On-demand CV OAM MUST be supported for MPLS-TP
   LSPs when IP addressing is in use.

   The On-demand CV echo response message MUST be sent on the reverse
   path of the LSP.  The reply MUST contain IP/UDP headers followed by
   the On-demand CV payload.  The destination address in the IP header
   MUST be set to that of the sender of the echo request message.  The
   source address in the IP header MUST be set to a valid address of the
   replying node.

3.2.  On-demand CV with IP encapsulation, over ACH

   IP encapsulated On-demand CV packets MAY be sent over the MPLS LSP
   using the control channel (ACH).  IP ACH type specified in [RFC4385]
   MUST be used in such a case.  The IP header is used mainly for
   addressing and can be used in the context of MPLS-TP LSPs.

   The On-demand CV echo response message MUST be sent on the reverse
   path of the LSP.  The response in this case SHOULD use ACH and SHOULD
   be IP encapsulated.



Bahadur, et al.         Expires December 17, 2011              [Page 10]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


   If IP encapsulated, the destination address in the IP header MUST be
   set to that of the sender of the echo request message, and the source
   address in the IP header MUST be set to a valid address of the
   replying node.

3.3.  Non-IP based On-demand CV, using ACH

   The OAM procedures defined in [RFC4379] require the use of IP
   addressing, and in some cases IP routing, to perform OAM functions.
   When the ACH header is used, IP addressing and routing is not needed.
   This section describes procedures for performing on-demand CV without
   a dependency on IP addressing and routing.

   In the non-IP case, when using On-demand CV via LSP-Ping with the ACH
   header, the LSP-Ping Reply mode [RFC4379] in the LSP-Ping echo
   request SHOULD be set to 4 (Reply via application level control
   channel).

   Note that the application level control channel in this case is the
   reverse path of the LSP (or Pseudowire) using ACH.

   The requesting node MAY attach a Source Identifier TLV (Section 2.2)
   to identify the node originating the request.

   If the Reply mode indicated in an On-demand CV Request is 4 (Reply
   via application level control channel), the On-demand CV reply
   message MUST be sent on the reverse path of the LSP using ACH.  The
   On-demand CV payload MUST directly follow the ACH header (and any ACH
   TLVs) and IP and/or UDP headers MUST NOT be attached.  The responding
   node MAY attach a Source Identifier TLV to identify the node sending
   the response.

   If a node receives an MPLS echo request packet over ACH, without IP/
   UDP headers, with a reply mode of 4, and if that node does not have a
   return MPLS LSP path to the echo request source, then the node SHOULD
   drop the echo request packet and not attempt to send a response.

   If a node receives an MPLS echo request with a reply mode other than
   4 (reply via application level control channel), and if the node
   supports that reply mode, then it MAY respond using that reply mode.
   If the node does not support the reply mode requested, or is unable
   to reply using the requested reply mode in any specific instance, the
   node MUST drop the echo request packet and not attempt to send a
   response.







Bahadur, et al.         Expires December 17, 2011              [Page 11]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


3.4.  Reverse Path Connectivity Verification

3.4.1.  Requesting Reverse Path Connectivity Verification

   A new global flag, Validate Reverse Path (R), is being defined in the
   LSP-Ping packet header.  When this flag is set in the echo request,
   the Responder SHOULD return reverse path FEC information, as
   described in Section 3.4.2.

   The R flag MUST NOT be set in the echo response.  If it is set in the
   echo response, it SHOULD be ignored.

   The Global Flags field is now a bit vector with the following format:


                       0                   1
                       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5
                      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                      |             MBZ         |R|T|V|
                      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                       Figure 7: Global Flags Field

   The V flag is defined in [RFC4379].  The T flag is defined in P2MP-
   LSP-PING.  The R flag is defined in this draft.

   The Validate FEC Stack (V) flag MAY be set in the echo response when
   reverse path connectivity verification is being performed.

3.4.2.  Responder Procedures

   When the R flag is set in the echo request, the responding node
   SHOULD attach a Reverse-path Target FEC Stack TLV in the echo
   response.  The requesting node (on receipt of the response) can use
   the Reverse-path Target FEC Stack TLV to perform reverse path
   connectivity verification.  For co-routed bi-directional LSPs, the
   Reverse-path Target FEC Stack used for On-demand CV will be the same
   in both the forward and reverse path of the LSP.  For associated bi-
   directional LSPs, the target FEC stack MAY be different for the
   reverse path.

   The format of the Reverse-path Target FEC Stack TLV is the same as
   that of the Target FEC stack TLV defined in [RFC4379].  The rules for
   creating a Target FEC stack TLV also apply to the Reverse-path Target
   FEC Stack TLV.





Bahadur, et al.         Expires December 17, 2011              [Page 12]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


             Value        TLV
             --------     ------------------------------------
             TBD-1        Reverse-path Target FEC Stack


             Figure 8: Reverse-Path Target FEC Stack TLV Type

3.4.3.  Requester Procedures

   On receipt of the echo response, the requesting node MUST perform the
   following checks:

   1.  Perform interface and label-stack validation to ensure that the
       packet is received on the reverse path of the bi-directional LSP
   2.  If the Reverse-Path Target FEC Stack TLV is present in the echo
       response, then perform FEC validation.

   The verification in this case is performed as described for Target
   FEC Stack in section 3.6 of [RFC4379].

   If any of the validations fail, then the requesting node MUST drop
   the echo response and report an error.

3.5.  P2MP Considerations

   [I-D.ietf-mpls-p2mp-lsp-ping] describes how LSP-Ping can be used for
   OAM on P2MP LSPs with IP encapsulation.  This MUST be supported for
   MPLS-TP P2MP LSPs when IP addressing is used.  When IP addressing is
   not used, then the procedures described in Section 3.3 can be applied
   to P2MP MPLS-TP LSPs as well.

3.6.  Operation of On-demand CV with Static MPLS-TP

   Support for static MPLS-TP LSP, or Pseudowire, usage and on-demand
   CV, requires manageable objects necessary to, for instance, configure
   operating parameters such as duration and periodicity of an on-demand
   connectivity test.

   The specifics of this manageability requirement are out-of-scope in
   this document and SHOULD be addressed in an appropriate management
   specification.

3.7.  GAL Label Processing

   At the Requester, when encapsulating the LSP echo request (LSP Ping)
   packet (with the IP ACH, or the non IP ACH, codepoint), a GAL label
   MUST be added before adding the MPLS LSP label, and sending the LSP
   Ping echo request packet in-band in the MPLS LSP.



Bahadur, et al.         Expires December 17, 2011              [Page 13]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


   The GAL label MUST NOT be considered as part of the MPLS label stack
   that requires verification by the Responder.  For this reason, a NIL
   FEC Stack TLV MUST NOT be added or associated with the GAL label.

   GAL Label MUST NOT be included in DSMAP or DDMAP TLVs.

   Interface and label stack TLV MUST include the whole label stack
   including the GAL label.


4.  Performing on-demand Route Tracing over MPLS-TP LSPs

   This section specifies how On-demand CV traceroute can be used in the
   context of MPLS-TP LSPs.  The On-demand CV traceroute function meets
   the Route Tracing requirement specified in [RFC5860], section 2.2.4.
   This function SHOULD be performed on-demand.  This function SHOULD be
   performed between End Points and Intermediate Points of PWs and LSPs,
   and between End Points of PWs, LSPs and Sections.

   When performing On-demand CV traceroute, the requesting node inserts
   a Downstream Mapping TLV to get the downstream node information and
   to enable LSP verification along the transit nodes.  The Downstream
   Mapping TLV can be used as is for performing the traceroute.  If IP
   addressing is not in use, then the Address Type field in the
   Downstream Mapping TLV can be set to "Non IP" (Section 2.1).  The
   Downstream Mapping TLV address type field can be extended to include
   other address types as need be.

4.1.  On-demand LSP Route Tracing with IP encapsulation

   The mechanics of On-demand CV traceroute are similar to those
   described for ping in Section 3.1.  On-demand Route Tracing packets
   sent by the Requester MUST follow procedures described in [RFC4379].
   This form of On-demand CV OAM MUST be supported for MPLS-TP LSPs,
   when IP addressing is used.

4.2.  Non-IP based On-demand LSP Route Tracing, using ACH

   This section describes procedures for performing LSP traceroute when
   using LSP-Ping with the ACH header and without any dependency on IP
   addressing.  The procedures specified in Section 3.3 with regards to
   Source Idenfier TLV apply to LSP traceroute as well.

4.2.1.  Requester procedure for sending echo request packets

   On-demand Route Tracing packets sent by the Requester MUST adhere to
   the format described in Section 3.3.  MPLS-TTL expiry (as described
   in [RFC4379]) will be used to direct the packets to specific nodes



Bahadur, et al.         Expires December 17, 2011              [Page 14]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


   along the LSP path.

4.2.2.  Requester procedure for receiving echo response packets

   The On-demand CV traceroute responses will be received on the LSP
   itself and the presence of an ACH header with channel type of On-
   demand CV is an indicator that the packet contains On-demand CV
   payload.

4.2.3.  Responder procedure

   When a echo request reaches the Responder, the presence of the ACH
   channel type of On-demand CV will indicate that the packet contains
   On-demand CV data.  The On-demand CV data, the label stack and the
   destination identifier should be sufficient to identify the LSP
   associated with the echo request packet.  If there is an error and
   the node is unable to identify the LSP on which the echo response
   would to be sent, the node MUST drop the echo request packet and not
   send any response back.  All responses MUST always be sent on a LSP
   path using the ACH header and ACH channel type of On-demand CV.

4.3.  P2MP Considerations

   [I-D.ietf-mpls-p2mp-lsp-ping] describes how LSP-Ping can be used for
   OAM on P2MP LSPs.  This MUST be supported for MPLS-TP P2MP LSPs when
   IP addressing is used.  When IP addressing is not used, then the
   procedures described in Section 4.2 can be applied to P2MP MPLS-TP
   LSPs as well.

4.4.  ECMP Considerations

   On-demand CV using ACH SHOULD NOT be used when there is ECMP (equal
   cost multiple paths) for a given LSP.  The addition of the additional
   ACH header may modify the hashing behavior for OAM packets which may
   result in incorrect monitoring of path taken by data traffic.


5.  Applicability

   The procedures specified in this document for non-IP encapsulation
   apply only to MPLS-TP Transport paths.  This includes LSPs and PWs
   when IP encapsulation is not desired.  However, when IP addressing is
   used, as in non MPLS-TP LSPs, procedures specified in [RFC4379] MUST
   be used.







Bahadur, et al.         Expires December 17, 2011              [Page 15]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


6.  Security Considerations

   The draft does not introduce any new security considerations.  Those
   discussed in [RFC4379] are also applicable to this document.


7.  IANA Considerations

7.1.  New Source and Destination Identifier TLVs

   IANA is requested to assign the following TLV types from the "Label
   Switched Paths (LSPs) Parameters - TLVs" Registry, "TLVs and sub-
   TLVs" sub-registry (from "Standards Action" TLV type range):

                                      Length
       Type #   TLV Name              Octets   Reference
       ------   --------------------  ------   ------------------------
       TBD-SRC  Source ID TLV              8   this document (sect 2.2)
       TBD-DST  Destination ID TLV         8   this document (sect 2.2)

           Figure 9: New Source/Destination Identifier TLV Type

7.2.  New Target FEC Stack Sub-TLVs

   Section 2.3 defines 2 new sub-TLV types for inclusion within the LSP
   Ping [RFC4379] Target FEC Stack TLV.

   IANA is requested to assign sub-type values to the following sub-TLVs
   from the "Multiprotocol Label Switching Architecture (MPLS) Label
   Switched Paths (LSPs) Parameters - TLVs" registry, "TLVs and sub-
   TLVs" sub-registry.

   Value    Meaning                           Reference
   -----    -------------------------         --------------------------
   22       Static LSP sub-TLV                this document (sect 2.4.1)
   23       Static Pseudowire sub-TLV         this document (sect 2.4.2)


7.3.  New Reverse-path Target FEC Stack TLV

   Section 3.4.2 defines a new TLV type for inclusion in the LSP-Ping
   packet.

   IANA is requested to assign a type value to the TLV from the
   "Multiprotocol Label Switching Architecture (MPLS) Label Switched
   Paths (LSPs) Parameters - TLVs" registry, "TLVs and sub-TLVs" sub-
   registry.




Bahadur, et al.         Expires December 17, 2011              [Page 16]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


   Value    Meaning                           Reference
   -----    --------------------------        ------------------------
   TBD-1    Reverse-path Target FEC           this document (sect 3.4)
            Stack TLV

   The sub-TLV space and assignments for this TLV will be the same as
   that for the Target FEC Stack TLV.  Sub-types for the Target FEC
   Stack TLV and the Reverse-path Target FEC Stack TLV MUST be kept the
   same.  Any new sub-type added to the Target FEC Stack TLV MUST apply
   to the Reverse-path Target FEC Stack TLV as well.

7.4.  New Pseudowire Associated Channel Type

   On-demand Connectivity Verification requires a unique Associated
   Channel Type.  IANA is requested to assign a PW ACh Type from the
   "Pseudowire Associated Channel Type Registry" as describe below:


     Value     Description      TLV Follows     Reference
     ------    -------------    -----------     ----------------------
     TBD-2     On-Demand CV          No         this document (sect 3)

7.5.  New RFC 4379 Registry

   [RFC4379] defined several registries.  It also defined some value
   assignments without explicitly asking for IANA to create a registry
   to support additional value assingments.  One such case is in
   defining address types associated with the Downstream Mapping (DSMAP)
   TLV.

   This document extends RFC 4379 by defining a new address type for use
   with the Downstream Mapping and Downstream Detailed Mapping TLVs.

   Recognizing that the absence of a registry makes it possible to have
   collisions of "address-type" usages, IANA is requested to establish a
   new registry - associated with both [RFC4379] and this document -
   that initially allocates the following assignments:

     Type #     Address Type      K Octets    Reference
     ------     ------------      --------    --------------------------
          1     IPv4 Numbered           16    RFC 4379
          2     IPv4 Unnumbered         16    RFC 4379
          3     IPv6 Numbered           40    RFC 4379
          4     IPv6 Unnumbered         28    RFC 4379
          5     Non IP                  12    this document (sect 2.1.1)

                 Downstream Mapping Address Type Registry




Bahadur, et al.         Expires December 17, 2011              [Page 17]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


   Because the field in this case is an 8-octet field, the basis for all
   future allocations SHOULD be "Standards Based."


8.  Contributing Authors

   The following individuals also contributed to this document:

   o  Thomas D. Nadeau, CA Technologies
   o  Nurit Sprecher, Nokia Siemens Networks
   o  Yaacov Weingarten, Nokia Siemens Networks


9.  References

9.1.  Normative References

   [I-D.ietf-mpls-lsp-ping-enhanced-dsmap]
              Bahadur, N., Kompella, K., and G. Swallow, "Mechanism for
              performing LSP-Ping over MPLS tunnels",
              draft-ietf-mpls-lsp-ping-enhanced-dsmap-09 (work in
              progress), May 2011.

   [I-D.ietf-mpls-p2mp-lsp-ping]
              Yasukawa, S., Farrel, A., Ali, Z., Swallow, G., Nadeau,
              T., and S. Saxena, "Detecting Data Plane Failures in
              Point-to-Multipoint Multiprotocol Label Switching (MPLS) -
              Extensions to LSP Ping", draft-ietf-mpls-p2mp-lsp-ping-16
              (work in progress), March 2011.

   [I-D.ietf-mpls-tp-identifiers]
              Bocci, M., Swallow, G., and E. Gray, "MPLS-TP
              Identifiers", draft-ietf-mpls-tp-identifiers-05 (work in
              progress), June 2011.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC4379]  Kompella, K. and G. Swallow, "Detecting Multi-Protocol
              Label Switched (MPLS) Data Plane Failures", RFC 4379,
              February 2006.

   [RFC4385]  Bryant, S., Swallow, G., Martini, L., and D. McPherson,
              "Pseudowire Emulation Edge-to-Edge (PWE3) Control Word for
              Use over an MPLS PSN", RFC 4385, February 2006.

   [RFC5586]  Bocci, M., Vigoureux, M., and S. Bryant, "MPLS Generic
              Associated Channel", RFC 5586, June 2009.



Bahadur, et al.         Expires December 17, 2011              [Page 18]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


9.2.  Informative References

   [I-D.ietf-mpls-tp-oam-framework]
              Allan, D., Busi, I., Niven-Jenkins, B., Fulignoli, A.,
              Hernandez-Valencia, E., Levrau, L., Sestito, V., Sprecher,
              N., Helvoort, H., Vigoureux, M., Weingarten, Y., and R.
              Winter, "Operations, Administration and Maintenance
              Framework for MPLS-based Transport Networks",
              draft-ietf-mpls-tp-oam-framework-11 (work in progress),
              February 2011.

   [RFC1122]  Braden, R., "Requirements for Internet Hosts -
              Communication Layers", STD 3, RFC 1122, October 1989.

   [RFC1812]  Baker, F., "Requirements for IP Version 4 Routers",
              RFC 1812, June 1995.

   [RFC5003]  Metz, C., Martini, L., Balus, F., and J. Sugimoto,
              "Attachment Individual Identifier (AII) Types for
              Aggregation", RFC 5003, September 2007.

   [RFC5860]  Vigoureux, M., Ward, D., and M. Betts, "Requirements for
              Operations, Administration, and Maintenance (OAM) in MPLS
              Transport Networks", RFC 5860, May 2010.

   [RFC5884]  Aggarwal, R., Kompella, K., Nadeau, T., and G. Swallow,
              "Bidirectional Forwarding Detection (BFD) for MPLS Label
              Switched Paths (LSPs)", RFC 5884, June 2010.


Authors' Addresses

   Nitin Bahadur
   Juniper Networks, Inc.
   1194 N. Mathilda Avenue
   Sunnyvale, CA  94089
   US

   Phone: +1 408 745 2000
   Email: nitinb@juniper.net
   URI:   www.juniper.net










Bahadur, et al.         Expires December 17, 2011              [Page 19]

Internet-Draft  MPLS On-demand Connectivity Verification       June 2011


   Rahul Aggarwal
   Juniper Networks, Inc.
   1194 N. Mathilda Avenue
   Sunnyvale, CA  94089
   US

   Phone: +1 408 745 2000
   Email: rahul@juniper.net
   URI:   www.juniper.net


   Sami Boutros
   Cisco Systems, Inc.
   3750 Cisco Way
   San Jose, CA  95134
   US

   Phone:
   Fax:
   Email: sboutros@cisco.com
   URI:


   Eric Gray
   Ericsson
   900 Chelmsford Street
   Lowell, MA  01851
   US

   Phone: +1 978 275 7470
   Fax:
   Email: eric.gray@ericsson.com
   URI:


















Bahadur, et al.         Expires December 17, 2011              [Page 20]

